app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 's12.dsow@me.com' LIMIT 1
---
	def create
		user = User.find_by(email: params[:session][:email])