app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = 4  [["name", "Raj Singh"], ["updated_at", "2015-02-05 04:00:44.098768"]]